





[
  {
    "id": 1,
    "estate_title": "Modern Family Home",
    "segment_name": "Single-family Home",
    "description": "This beautifully designed modern family home is situated in a quiet and serene suburban neighborhood. With 4 spacious bedrooms and 3 bathrooms, this home offers plenty of space for a growing family. The open-plan living and dining area boasts natural light and modern finishes, creating a comfortable and welcoming environment for family gatherings. The kitchen is fully equipped with state-of-the-art appliances, and the backyard features a private swimming pool, perfect for relaxing on hot summer days. Additional amenities include a two-car garage, a home office, and a large garden area. This beautifully designed modern family home is situated in a quiet and serene suburban neighborhood. With 4 spacious bedrooms and 3 bathrooms, this home offers plenty of space for a growing family. The open-plan living and dining area boasts natural light and modern finishes, creating a comfortable and welcoming environment for family gatherings. The kitchen is fully equipped with state-of-the-art appliances, and the backyard features a private swimming pool, perfect for relaxing on hot summer days. Additional amenities include a two-car garage, a home office, and a large garden area. Located close to schools, parks, and shopping centers, this home provides both luxury and convenience.",
    "price": "$500,000",
    "status": "sale",
    "area": "2500 sq ft",
    "location": "123 Maple Street, Springfield",
    "facilities": ["living room", "swimming pool", "kitchen"],
    "image": "https://i.ibb.co.com/KpyWhmVt/premium-photo-1734543932204-8574dbfa7c40-q-80-w-20.jpg",
    "view_property": "View Property"
  },
  {
    "id": 2,
    "estate_title": "Luxury Apartment",
    "segment_name": "Apartment",
    "description": "Located in the heart of the bustling city, this stunning 3-bedroom luxury apartment offers breathtaking skyline views and all the modern amenities you could ask for. The apartment features floor-to-ceiling windows, flooding the space with natural light and providing panoramic views of the city. The spacious master bedroom comes with a walk-in closet and an en-suite bathroom, while the other two bedrooms are generously sized and share a modern bathroom. The open-concept living area connects to a sleek, fully equipped kitchen with high-end appliances. Residents of the building can enjoy exclusive access to the on-site gym, spa, and rooftop terrace. Located in the heart of the bustling city, this stunning 3-bedroom luxury apartment offers breathtaking skyline views and all the modern amenities you could ask for. The apartment features floor-to-ceiling windows, flooding the space with natural light and providing panoramic views of the city. The spacious master bedroom comes with a walk-in closet and an en-suite bathroom, while the other two bedrooms are generously sized and share a modern bathroom. The open-concept living area connects to a sleek, fully equipped kitchen with high-end appliances. Residents of the building can enjoy exclusive access to the on-site gym, spa, and rooftop terrace. This apartment is perfect for those seeking a sophisticated urban lifestyle.",
    "price": "$750,000",
    "status": "new",
    "area": "1800 sq ft",
    "location": "789 City Center Blvd, Metropolis",
    "facilities": ["living room", "gym", "kitchen"],
    "image": "https://i.ibb.co.com/C3tmDyr3/premium-photo-1734543932204-8574dbfa7c40-q-80-w-20-1.jpg",
    "view_property": "View Property"
  },
  {
    "id": 3,
    "estate_title": "Cozy Student Housing",
    "segment_name": "Student Housing",
    "description": "This cozy 2-bedroom student housing is designed for the ultimate convenience and affordability for students. Located just a short walk from the university campus, the apartment offers easy access to public transportation, restaurants, and shopping. The two bedrooms come fully furnished with study desks, closets, and comfortable beds, making it an ideal space for students. A shared living room provides a great space for relaxation, while the fully equipped kitchen makes meal preparation easy. On-site laundry facilities and a study room ensure a comfortable and productive living environment for students. The affordable monthly rent makes this an excellent choice for budget-conscious students. This cozy 2-bedroom student housing is designed for the ultimate convenience and affordability for students. Located just a short walk from the university campus, the apartment offers easy access to public transportation, restaurants, and shopping. The two bedrooms come fully furnished with study desks, closets, and comfortable beds, making it an ideal space for students. A shared living room provides a great space for relaxation, while the fully equipped kitchen makes meal preparation easy. On-site laundry facilities and a study room ensure a comfortable and productive living environment for students. The affordable monthly rent makes this an excellent choice for budget-conscious students.",
    "price": "$1,200/month",
    "status": "rent",
    "area": "900 sq ft",
    "location": "456 University Lane, College Town",
    "facilities": ["study room", "laundry", "kitchen"],
    "image": "https://i.ibb.co.com/twkdjZz2/premium-photo-1734543932204-8574dbfa7c40-q-80-w-20.png",
    "view_property": "View Property"
  },
  {
    "id": 4,
    "estate_title": "Senior Living Community Home",
    "segment_name": "Senior Living",
    "description": "This senior living community home is designed for comfort, safety, and ease of living. Located in a peaceful community, the home offers assisted living services, ensuring that residents receive the care they need while maintaining their independence. The home features a spacious living area, a modern kitchen, and a private garden where residents can enjoy outdoor activities. With its 2 bedrooms and 2 bathrooms, the home is perfect for seniors seeking a tranquil living space. Residents also have access to community amenities such as a clubhouse, fitness center, and beautifully landscaped gardens. This senior living community provides a friendly, welcoming environment that promotes social interaction and an active lifestyle.This senior living community home is designed for comfort, safety, and ease of living. Located in a peaceful community, the home offers assisted living services, ensuring that residents receive the care they need while maintaining their independence. The home features a spacious living area, a modern kitchen, and a private garden where residents can enjoy outdoor activities. With its 2 bedrooms and 2 bathrooms, the home is perfect for seniors seeking a tranquil living space. Residents also have access to community amenities such as a clubhouse, fitness center, and beautifully landscaped gardens. This senior living community provides a friendly, welcoming environment that promotes social interaction and an active lifestyle.",
    "price": "$3,500/month",
    "status": "rent",
    "area": "1500 sq ft",
    "location": "321 Serenity Drive, Palm Springs",
    "facilities": ["living room", "garden", "kitchen"],
    "image": "https://i.ibb.co.com/9HJNB21V/photo-1513584684374-8bab748fbf90-q-80-w-2065-auto.jpg",
    "view_property": "View Property"
  },
  {
    "id": 5,
    "estate_title": "Beachside Vacation Home",
    "segment_name": "Vacation Rental",
    "description": "Escape to this beautiful 2-bedroom beachfront vacation home, perfect for a peaceful getaway. This property offers stunning ocean views from the large windows and private deck, where you can relax and take in the sound of the waves. The home features an open-concept living room with a modern kitchen, fully equipped for your cooking needs. Both bedrooms are spacious and include comfortable beds, perfect for unwinding after a day on the beach. With direct beach access, this home is ideal for those looking to enjoy a relaxing vacation by the water. Additional amenities include a barbecue area, outdoor shower, and high-speed Wi-Fi. Whether you're looking to surf, swim, or simply relax, this vacation home has everything you need. Escape to this beautiful 2-bedroom beachfront vacation home, perfect for a peaceful getaway. This property offers stunning ocean views from the large windows and private deck, where you can relax and take in the sound of the waves. The home features an open-concept living room with a modern kitchen, fully equipped for your cooking needs. Both bedrooms are spacious and include comfortable beds, perfect for unwinding after a day on the beach. With direct beach access, this home is ideal for those looking to enjoy a relaxing vacation by the water. Additional amenities include a barbecue area, outdoor shower, and high-speed Wi-Fi. Whether you're looking to surf, swim, or simply relax, this vacation home has everything you need.",
    "price": "$2,500/week",
    "status": "sale",
    "area": "1600 sq ft",
    "location": "987 Ocean Drive, Laguna Beach",
    "facilities": ["living room", "beach access", "kitchen"],
    "image": "https://i.ibb.co.com/hJQY77NQ/premium-photo-1734543932204-8574dbfa7c40-q-80-w-20-2.png",
    "view_property": "View Property"
  },
  {
    "id": 6,
    "estate_title": "Spacious Townhouse",
    "segment_name": "Townhouse",
    "description": "This spacious 3-bedroom townhouse offers modern living in a vibrant urban setting. Spread over three floors, this home features a private rooftop garden, perfect for entertaining guests or enjoying a quiet evening outdoors. The open-plan living and dining area offers plenty of space for relaxation, while the kitchen is fully equipped with high-end appliances. The master bedroom includes a walk-in closet and en-suite bathroom, while the other two bedrooms share a modern family bathroom. A private garage provides parking for two vehicles, and the property is within walking distance of shops, restaurants, and public transportation. This townhouse is ideal for those looking for the convenience of city living without compromising on space. This spacious 3-bedroom townhouse offers modern living in a vibrant urban setting. Spread over three floors, this home features a private rooftop garden, perfect for entertaining guests or enjoying a quiet evening outdoors. The open-plan living and dining area offers plenty of space for relaxation, while the kitchen is fully equipped with high-end appliances. The master bedroom includes a walk-in closet and en-suite bathroom, while the other two bedrooms share a modern family bathroom. A private garage provides parking for two vehicles, and the property is within walking distance of shops, restaurants, and public transportation. This townhouse is ideal for those looking for the convenience of city living without compromising on space.",
    "price": "$600,000",
    "status": "new",
    "area": "2000 sq ft",
    "location": "654 Urban Street, Downtown",
    "facilities": ["living room", "rooftop garden", "kitchen"],
    "image": "https://i.ibb.co.com/35YDnK0Z/premium-photo-1734543932204-8574dbfa7c40-q-80-w-20-2.jpg",
    "view_property": "View Property"
  }
]


  